clg/app/controllers/caretakers/application_controller.rb

SELECT "caretakers".* FROM "caretakers" WHERE "caretakers"."id" = 1 LIMIT 1
---
  def current_caretaker
    @current_caretaker ||= begin
      caretaker = super

      Rails.logger.debug "Raw current_caretaker from Devise: #{caretaker.inspect}"
      Rails.logger.debug "Class: #{caretaker.class}"

      # If it's a hash (session corruption), find the actual object
      if caretaker.is_a?(Hash)
        Rails.logger.warn "current_caretaker is a Hash, converting to Caretaker object"
        caretaker_id = caretaker["id"] || caretaker[:id]
        if caretaker_id
          found_caretaker = Caretaker.find_by(id: caretaker_id)