clg/app/controllers/caretakers/dashboard_controller.rb

  def index
    # Debug current_caretaker
    Rails.logger.debug "Current caretaker class: #{current_caretaker.class}"
    Rails.logger.debug "Current caretaker: #{current_caretaker.inspect}"

    unless current_caretaker.is_a?(Caretaker)
      Rails.logger.error "current_caretaker is not a Caretaker object: #{current_caretaker.class}"
      redirect_to new_caretaker_session_path, alert: "Please sign in again."
      return
    end

    @patients = current_caretaker.patients
                               .includes(:vital_signs, :activities, :geofence_zones, :device_logs, :patient_caretakers)

    # Dashboard statistics
    @total_patients = @patients.count
    @primary_patients = current_caretaker.primary_patients_count
    @patients_with_alerts = current_caretaker.patients_needing_attention.count
    @critical_alerts = current_caretaker.critical_alerts_count

    # Recent vital signs data for charts
    @vital_signs_chart_data = prepare_vital_signs_chart_data

    # Location data for live map
    @location_data = @patients.map do |patient|
      {
        id: patient.id,
        name: patient.name,
        latitude: patient.latitude,
        longitude: patient.longitude,
        status: patient.location_status,
        last_seen: patient.last_seen_at,
        primary: current_caretaker.primary_patients.include?(patient)
---
SELECT "activities".* FROM "activities" WHERE "activities"."patient_id" IN (1, 2, 3)
SELECT "device_logs".* FROM "device_logs" WHERE "device_logs"."patient_id" IN (1, 2, 3)
SELECT "geofence_zones".* FROM "geofence_zones" WHERE "geofence_zones"."patient_id" IN (1, 2, 3)
SELECT "patient_caretakers".* FROM "patient_caretakers" WHERE "patient_caretakers"."patient_id" IN (1, 2, 3)
SELECT COUNT(*) FROM "patients" INNER JOIN "patient_caretakers" ON "patients"."id" = "patient_caretakers"."patient_id" WHERE "patient_caretakers"."caretaker_id" = 1
SELECT 1 AS one FROM "vital_signs" WHERE "vital_signs"."patient_id" = 1 AND (recorded_at > '2025-10-03 16:38:45.473960') LIMIT 1

  def live_patient_data
    patient = current_caretaker.patients.find(params[:patient_id])

    data = {
      location: {
        latitude: patient.latitude,
        longitude: patient.longitude,
        status: patient.location_status,
        last_seen: patient.last_seen_at
      },
      vitals: patient.latest_vital_signs&.as_json(
        only: [ :heart_rate, :blood_pressure_systolic, :blood_pressure_diastolic, :temperature, :recorded_at ],
        methods: [ :status, :status_color ]
      ),
      recent_activities: patient.activities.recent.limit(5).as_json(
        only: [ :activity_type, :description, :recorded_at ],
        methods: [ :formatted_type, :time_ago ]
      ),
      device_status: patient.device_logs.recent.group(:device_type).maximum(:recorded_at)
---
SELECT "activities".* FROM "activities" WHERE "activities"."patient_id" IN (1, 2, 3)
SELECT "device_logs".* FROM "device_logs" WHERE "device_logs"."patient_id" IN (1, 2, 3)
SELECT "patients".* FROM "patients" INNER JOIN "patient_caretakers" ON "patients"."id" = "patient_caretakers"."patient_id" WHERE "patient_caretakers"."caretaker_id" = 1

  def prepare_vital_signs_chart_data
    # Get vital signs for all patients in the last 24 hours for trending
    chart_data = {}

    @patients.each do |patient|
      recent_vitals = patient.vital_signs
                             .where("recorded_at > ?", 24.hours.ago)
                             .order(:recorded_at)
                             .limit(50)

      if recent_vitals.any?
        # Prepare data for Chart.js format
        timestamps = recent_vitals.pluck(:recorded_at).map { |time| time.strftime("%H:%M") }

        chart_data[patient.name] = {
          patient_id: patient.id,
          labels: timestamps,
          datasets: {
            heart_rate: recent_vitals.pluck(:heart_rate),
            temperature: recent_vitals.pluck(:temperature).map { |temp| temp&.round(2) },
            blood_pressure_systolic: recent_vitals.pluck(:blood_pressure_systolic),
            blood_pressure_diastolic: recent_vitals.pluck(:blood_pressure_diastolic)
          },
          latest_status: recent_vitals.last&.status || "unknown",
          latest_readings: {
            heart_rate: recent_vitals.last&.heart_rate,
            temperature: recent_vitals.last&.temperature&.round(2),
            blood_pressure: "#{recent_vitals.last&.blood_pressure_systolic}/#{recent_vitals.last&.blood_pressure_diastolic}"
---
SELECT "vital_signs".* FROM "vital_signs" WHERE "vital_signs"."patient_id" = 1 AND (recorded_at > '2025-10-03 16:38:45.473960') ORDER BY "vital_signs"."recorded_at" ASC LIMIT 50
SELECT 1 AS one FROM "vital_signs" WHERE "vital_signs"."patient_id" = 1 AND (recorded_at > '2025-10-03 16:38:45.473960') LIMIT 1
SELECT "vital_signs"."recorded_at" FROM "vital_signs" WHERE "vital_signs"."patient_id" = 1 AND (recorded_at > '2025-10-03 16:43:28.867531') ORDER BY "vital_signs"."recorded_at" ASC LIMIT 50
SELECT "vital_signs"."blood_pressure_diastolic" FROM "vital_signs" WHERE "vital_signs"."patient_id" = 1 AND (recorded_at > '2025-10-03 16:43:28.867531') ORDER BY "vital_signs"."recorded_at" ASC LIMIT 50
SELECT "vital_signs".* FROM "vital_signs" WHERE "vital_signs"."patient_id" = 1 AND (recorded_at > '2025-10-03 16:43:28.867531') ORDER BY "vital_signs"."recorded_at" ASC LIMIT 50

  def prepare_device_status_summary
    device_logs = DeviceLog.joins(:patient)
                           .where(patient: @patients)
                           .where("recorded_at > ?", 1.hour.ago)

    {
      total_devices: device_logs.distinct.count(:device_id),
      active_devices: device_logs.where("recorded_at > ?", 10.minutes.ago).distinct.count(:device_id),
      low_battery_devices: device_logs.low_battery.distinct.count(:device_id),
      poor_signal_devices: device_logs.poor_signal.distinct.count(:device_id),
      device_types: device_logs.group(:device_type).distinct.count(:device_id)
---
SELECT COUNT(DISTINCT "device_logs"."device_id") FROM "device_logs" INNER JOIN "patients" ON "patients"."id" = "device_logs"."patient_id" WHERE "device_logs"."patient_id" IN (SELECT "patients"."id" FROM "patients" INNER JOIN "patient_caretakers" ON "patients"."id" = "patient_caretakers"."patient_id" WHERE "patient_caretakers"."caretaker_id" = 1) AND (recorded_at > '2025-10-04 15:43:28.876592') AND (recorded_at > '2025-10-04 16:33:28.877198')