clg/app/controllers/caretakers/patients_controller.rb

  def index
    @patients = current_caretaker.patients
                               .includes(:vital_signs, :activities, :device_logs, :primary_caretaker)
                               .order(:name)

    @primary_patients = @patients.select { |p| p.primary_caretaker == current_caretaker }
---
SELECT "activities".* FROM "activities" WHERE "activities"."patient_id" IN (3, 2, 1)
SELECT "device_logs".* FROM "device_logs" WHERE "device_logs"."patient_id" IN (3, 2, 1)
SELECT "patients".* FROM "patients" INNER JOIN "patient_caretakers" ON "patients"."id" = "patient_caretakers"."patient_id" WHERE "patient_caretakers"."caretaker_id" = 1 ORDER BY "patients"."name" ASC
SELECT "vital_signs".* FROM "vital_signs" WHERE "vital_signs"."patient_id" IN (3, 2, 1)

  def show
    @assignment = current_caretaker.patient_caretakers.find_by(patient: @patient)
    @vital_signs = @patient.vital_signs.recent.order(recorded_at: :desc).limit(50)
    @activities = @patient.activities.recent.order(recorded_at: :desc).limit(30)
    @device_logs = @patient.device_logs.recent.order(recorded_at: :desc).limit(100)
    @geofence_zones = @patient.geofence_zones.active

    # Vital signs statistics
    @vitals_stats = calculate_vitals_statistics(@vital_signs)

    # Device status
    @device_status = @device_logs.group(:device_type).group(:device_id).maximum(:recorded_at)
---
SELECT "patients".* FROM "patients" INNER JOIN "patient_caretakers" ON "patients"."id" = "patient_caretakers"."patient_id" WHERE "patient_caretakers"."caretaker_id" = 1 AND "patients"."id" = 1 LIMIT 1
SELECT "patient_caretakers".* FROM "patient_caretakers" WHERE "patient_caretakers"."caretaker_id" = 1 AND "patient_caretakers"."patient_id" = 1 LIMIT 1
SELECT MAX("device_logs"."recorded_at") AS "maximum_recorded_at", "device_logs"."device_type" AS "device_logs_device_type", "device_logs"."device_id" AS "device_logs_device_id" FROM "device_logs" WHERE "device_logs"."patient_id" = 1 AND (recorded_at > '2025-10-03 16:45:25.480397') GROUP BY "device_logs"."device_type", "device_logs"."device_id" ORDER BY "device_logs"."recorded_at" DESC LIMIT 100

  def vitals_chart_data
    @patient = current_caretaker.patients.find(params[:id])
    period = params[:period]&.to_i || 24 # hours

    vital_signs = @patient.vital_signs
                          .where("recorded_at > ?", period.hours.ago)
                          .order(:recorded_at)

    render json: {
      labels: vital_signs.pluck(:recorded_at).map { |time| time.strftime("%H:%M") },
      datasets: [
        {
          label: "Heart Rate (BPM)",
          data: vital_signs.pluck(:heart_rate),
          borderColor: "rgb(220, 53, 69)",
          backgroundColor: "rgba(220, 53, 69, 0.1)",
          yAxisID: "y"
        },
        {
          label: "Systolic BP",
          data: vital_signs.pluck(:blood_pressure_systolic),
          borderColor: "rgb(0, 123, 255)",
          backgroundColor: "rgba(0, 123, 255, 0.1)",
          yAxisID: "y1"
        },
        {
          label: "Diastolic BP",
          data: vital_signs.pluck(:blood_pressure_diastolic),
          borderColor: "rgb(0, 123, 255, 0.7)",
          backgroundColor: "rgba(0, 123, 255, 0.05)",
          yAxisID: "y1"
---
SELECT "patients".* FROM "patients" INNER JOIN "patient_caretakers" ON "patients"."id" = "patient_caretakers"."patient_id" WHERE "patient_caretakers"."caretaker_id" = 1 AND "patients"."id" = 3 LIMIT 1
SELECT "vital_signs"."recorded_at" FROM "vital_signs" WHERE "vital_signs"."patient_id" = 3 AND (recorded_at > '2025-10-03 16:45:22.780685') ORDER BY "vital_signs"."recorded_at" ASC
SELECT "vital_signs"."heart_rate" FROM "vital_signs" WHERE "vital_signs"."patient_id" = 3 AND (recorded_at > '2025-10-03 16:45:22.780685') ORDER BY "vital_signs"."recorded_at" ASC
SELECT "vital_signs"."blood_pressure_systolic" FROM "vital_signs" WHERE "vital_signs"."patient_id" = 3 AND (recorded_at > '2025-10-03 16:45:22.780685') ORDER BY "vital_signs"."recorded_at" ASC
SELECT "vital_signs"."blood_pressure_diastolic" FROM "vital_signs" WHERE "vital_signs"."patient_id" = 3 AND (recorded_at > '2025-10-03 16:45:22.780685') ORDER BY "vital_signs"."recorded_at" ASC

  def set_patient
    @patient = current_caretaker.patients.find(params[:id])
---
SELECT "patients".* FROM "patients" INNER JOIN "patient_caretakers" ON "patients"."id" = "patient_caretakers"."patient_id" WHERE "patient_caretakers"."caretaker_id" = 1 AND "patients"."id" = 1 LIMIT 1