clg/app/controllers/caretakers/sessions_controller.rb

  def create
    self.resource = warden.authenticate!(auth_options)

    # Force reload to ensure we have a proper object
    if resource.is_a?(Hash)
      Rails.logger.error "Caretaker authentication returned Hash, finding proper object"
      caretaker_id = resource["id"] || resource[:id]
      self.resource = Caretaker.find(caretaker_id) if caretaker_id
---
SELECT "caretakers".* FROM "caretakers" WHERE "caretakers"."id" = 3 ORDER BY "caretakers"."id" ASC LIMIT 1