clg/app/views/geofence_zones/edit.html.erb

    <!-- Other Zones -->
    <% other_zones = @patient.geofence_zones.where.not(id: @geofence_zone.id) %>
---
SELECT "geofence_zones".* FROM "geofence_zones" WHERE "geofence_zones"."patient_id" = 2 AND "geofence_zones"."id" != 4