clg/app/views/geofence_zones/index.html.erb

            <div class="zones-list">
              <% if patient.geofence_zones.any? %>
                <div class="small mb-2 text-muted fw-bold">Zones (<%= patient.geofence_zones.count %>)</div>
---
SELECT "geofence_zones".* FROM "geofence_zones" WHERE "geofence_zones"."patient_id" IN (1, 2, 3)
SELECT COUNT(*) FROM "geofence_zones" WHERE "geofence_zones"."patient_id" = 1