clg/app/views/geofence_zones/new.html.erb

    <!-- Existing Zones -->
    <% if @patient.geofence_zones.any? %>
---
SELECT "geofence_zones".* FROM "geofence_zones" WHERE "geofence_zones"."patient_id" = 1
SELECT COUNT(*) FROM "geofence_zones" WHERE "geofence_zones"."patient_id" = 1

          <h6 class="mb-0">
            <i class="bi bi-shield-check me-2"></i>Existing Zones (<%= @patient.geofence_zones.count %>)
---
SELECT COUNT(*) FROM "geofence_zones" WHERE "geofence_zones"."patient_id" = 1

        <div class="card-body">
          <% @patient.geofence_zones.each do |zone| %>
---
SELECT "geofence_zones".* FROM "geofence_zones" WHERE "geofence_zones"."patient_id" = 1