clg/app/views/dashboard/index.html.erb

SELECT "geofence_zones".* FROM "geofence_zones" WHERE "geofence_zones"."patient_id" = 1 AND "geofence_zones"."active" = 1
---
      // Add geofence zones for this patient
      <% patient.geofence_zones.active.each do |zone| %>