clg/app/models/caretaker.rb

SELECT "patients".* FROM "patients" INNER JOIN "patient_caretakers" ON "patients"."id" = "patient_caretakers"."patient_id" WHERE "patient_caretakers"."caretaker_id" = 1
---
  def recent_device_logs
    DeviceLog.joins(:patient).where(patient: patients).recent.limit(50)