clg/app/models/patient_caretaker.rb

SELECT 1 AS one FROM "patient_caretakers" WHERE "patient_caretakers"."patient_id" = 1 AND "patient_caretakers"."primary_caretaker" = 1 AND "patient_caretakers"."id" IS NOT NULL LIMIT 1
---
  def only_one_primary_caretaker_per_patient
    if primary_caretaker? && patient_id.present?
      existing_primary = PatientCaretaker.where(patient_id: patient_id, primary_caretaker: true)
                                        .where.not(id: id)
      if existing_primary.exists?