clg/app/controllers/dashboard_controller.rb

SELECT "activities".* FROM "activities" WHERE "activities"."patient_id" IN (1, 2, 3)
SELECT "geofence_zones".* FROM "geofence_zones" WHERE "geofence_zones"."patient_id" IN (1, 2, 3)
SELECT "patients".* FROM "patients" WHERE "patients"."user_id" = 1
SELECT "vital_signs".* FROM "vital_signs" WHERE "vital_signs"."patient_id" IN (1, 2, 3)
SELECT "notifications".* FROM "notifications" WHERE "notifications"."user_id" = 1 AND "notifications"."read" = 0 ORDER BY "notifications"."created_at" DESC LIMIT 5
SELECT COUNT(*) FROM "patients" WHERE "patients"."user_id" = 1
SELECT COUNT(*) FROM "notifications" WHERE "notifications"."user_id" = 1 AND "notifications"."read" = 0 AND "notifications"."priority" = 'critical'
---
  def index
    @patients = current_user.patients.includes(:vital_signs, :activities, :geofence_zones)
    @recent_notifications = current_user.notifications.unread.recent.limit(5)
    @total_patients = @patients.count
    @patients_in_safe_zones = @patients.count { |p| p.location_status == "safe" }
    @patients_away = @patients.count { |p| p.location_status == "away" }
    @patients_outside_zones = @patients.count { |p| p.location_status == "outside_zone" }
    @patients_offline = @patients.count { |p| p.location_status == "offline" }
    @critical_alerts = current_user.notifications.unread.by_priority("critical").count