clg/app/controllers/geofence_zones_controller.rb

SELECT "geofence_zones".* FROM "geofence_zones" WHERE "geofence_zones"."patient_id" IN (1, 2, 3)
SELECT "patients".* FROM "patients" WHERE "patients"."user_id" = 1
SELECT COUNT(*) FROM "geofence_zones" INNER JOIN "patients" ON "patients"."id" = "geofence_zones"."patient_id" WHERE "geofence_zones"."patient_id" IN (SELECT "patients"."id" FROM "patients" WHERE "patients"."user_id" = 1)
---
  def index
    @patients = current_user.patients.includes(:geofence_zones)

SELECT "patients".* FROM "patients" WHERE "patients"."user_id" = 1 AND "patients"."id" = 1 LIMIT 1
---
  def set_patient
    @patient = current_user.patients.find(params[:patient_id]) if params[:patient_id]

SELECT "geofence_zones".* FROM "geofence_zones" WHERE "geofence_zones"."patient_id" = 1 AND "geofence_zones"."id" = 1 LIMIT 1
---
  def set_geofence_zone
    if @patient
      @geofence_zone = @patient.geofence_zones.find(params[:id])