clg/app/controllers/notifications_controller.rb

SELECT "patients".* FROM "patients" WHERE "patients"."id" IN (2, 1, 3)
SELECT 1 AS one FROM "notifications" WHERE "notifications"."user_id" = 1 LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM "notifications" WHERE "notifications"."user_id" = 1
SELECT "notifications".* FROM "notifications" WHERE "notifications"."user_id" = 1 ORDER BY "notifications"."created_at" DESC LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM (SELECT 1 AS one FROM "notifications" WHERE "notifications"."user_id" = 1 LIMIT 20 OFFSET 0) subquery_for_count
---
  def index
    notifications_query = current_user.notifications
                                     .includes(:patient)
                                     .recent

    @unread_count = current_user.unread_notifications_count
    @filter_type = params[:type]
    @filter_priority = params[:priority]

    notifications_query = notifications_query.by_type(@filter_type) if @filter_type.present?
    notifications_query = notifications_query.by_priority(@filter_priority) if @filter_priority.present?

    # Simple pagination without Kaminari
    @per_page = 20
    @current_page = (params[:page] || 1).to_i
    @total_count = notifications_query.count
    @total_pages = (@total_count.to_f / @per_page).ceil

    @notifications = notifications_query.limit(@per_page)
                                       .offset((@current_page - 1) * @per_page)

SELECT "notifications".* FROM "notifications" WHERE "notifications"."user_id" = 1 AND "notifications"."id" = 6 LIMIT 1
---
  def set_notification
    @notification = current_user.notifications.find(params[:id])