clg/app/controllers/patients_controller.rb

SELECT "activities".* FROM "activities" WHERE "activities"."patient_id" IN (1, 2, 3)
SELECT "geofence_zones".* FROM "geofence_zones" WHERE "geofence_zones"."patient_id" IN (1, 2, 3)
SELECT "patients".* FROM "patients" WHERE "patients"."user_id" = 1
SELECT "vital_signs".* FROM "vital_signs" WHERE "vital_signs"."patient_id" IN (1, 2, 3)
---
  def index
    @patients = current_user.patients.includes(:vital_signs, :activities, :geofence_zones)

SELECT "vital_signs".* FROM "vital_signs" WHERE "vital_signs"."patient_id" = 1 ORDER BY "vital_signs"."recorded_at" DESC LIMIT 10
---
  def show
    @latest_vital_signs = @patient.vital_signs.order(recorded_at: :desc).limit(10)

SELECT "patients".* FROM "patients" WHERE "patients"."user_id" = 1 AND "patients"."id" = 1 LIMIT 1
---
  def set_patient
    @patient = current_user.patients.find(params[:id])