clg/app/controllers/api/v1/patients_controller.rb

  def locations
    # Get locations for all of the current user's patients
    locations_data = current_user.patients.map do |patient|
---
SELECT "patients".* FROM "patients" WHERE "patients"."user_id" = 1