clg/app/controllers/api/v1/vitals_controller.rb

SELECT "patients".* FROM "patients" WHERE "patients"."user_id" = 1
SELECT "vital_signs".* FROM "vital_signs" WHERE "vital_signs"."patient_id" IN (1, 2, 3)
SELECT "vital_signs".* FROM "vital_signs" WHERE "vital_signs"."patient_id" = 1 ORDER BY "vital_signs"."recorded_at" DESC LIMIT 1
---
  def latest
    # Get latest vital signs for all of the current user's patients
    vital_signs_data = current_user.patients.includes(:vital_signs).map do |patient|
      latest_vitals = patient.vital_signs.order(recorded_at: :desc).first