clg/app/views/patients/index.html.erb

SELECT "geofence_zones".* FROM "geofence_zones" WHERE "geofence_zones"."patient_id" = 1 AND "geofence_zones"."active" = 1
---
                  <div class="small">
                    <% patient.geofence_zones.active.each do |zone| %>

SELECT 1 AS one FROM "geofence_zones" WHERE "geofence_zones"."patient_id" = 1 AND "geofence_zones"."active" = 1 LIMIT 1
---
                    <% end %>
                    <% if patient.geofence_zones.active.empty? %>